Revit 2027 API
ParameterTypeId.ReferenceLineSubcategory Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ReferenceLineSubcategory { get; }
Public Shared ReadOnly Property ReferenceLineSubcategory As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ReferenceLineSubcategory {
	ForgeTypeId^ get ();
}
static member ReferenceLineSubcategory : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace